[
  {"id": 1, "location": "ferry ride in Vancouver", "formality": 2, "description": "Step into a ferry ride in Vancouver, where faint music from a speaker meets local vendors shouting deals. This location blends modern energy with a local charm, inviting visitors to linger amid stylish pedestrians. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 2, "location": "sunset pier in Santa Monica", "formality": 2, "description": "Step into a sunset pier in Santa Monica, where the hum of scooters meets sunlight filtering through awnings. This location blends modern energy with a local charm, inviting visitors to linger amid street performers nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 3, "location": "suburban street in Melbourne", "formality": 2, "description": "Step into a suburban street in Melbourne, where distant horns meets coffee steam rising from cups. This location blends modern energy with a local charm, inviting visitors to linger amid pop-up shops and stalls. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 4, "location": "café terrace in Amsterdam", "formality": 2, "description": "Step into a café terrace in Amsterdam, where laughter from nearby diners meets kids playing soccer. This location blends modern energy with a local charm, inviting visitors to linger amid lingering tourists. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 5, "location": "train platform in Tokyo", "formality": 2, "description": "Step into a train platform in Tokyo, where chirping birds in trees meets workers chatting at food stalls. This location blends modern energy with a local charm, inviting visitors to linger amid roaming photographers. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 6, "location": "historic alley in Lisbon", "formality": 3, "description": "Step into a historic alley in Lisbon, where footsteps echoing off buildings meets street art decorating the walls. This location blends modern energy with a local charm, inviting visitors to linger amid skaters and dancers moving through. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 7, "location": "boardwalk in Atlantic City", "formality": 3, "description": "Step into a boardwalk in Atlantic City, where buskers playing violins meets waves crashing in the distance. This location blends modern energy with a local charm, inviting visitors to linger amid artsy passersby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 8, "location": "art district in Berlin", "formality": 3, "description": "Step into a art district in Berlin, where rustling palm fronds meets commuters rushing past. This location blends modern energy with a local charm, inviting visitors to linger amid relaxed locals enjoying the scene. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 9, "location": "canal-side path in Venice", "formality": 3, "description": "Step into a canal-side path in Venice, where nearby skateboarders meets backpacks slung over shoulders. This location blends modern energy with a local charm, inviting visitors to linger amid visitors taking selfies. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 10, "location": "metro entrance in Paris", "formality": 3, "description": "Step into a metro entrance in Paris, where street musicians meets umbrellas lining the walkway. This location blends modern energy with a local charm, inviting visitors to linger amid content creators filming nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 11, "location": "corner diner in Brooklyn", "formality": 2, "description": "Step into a corner diner in Brooklyn, where faint music from a speaker meets local vendors shouting deals. This location blends modern energy with a local charm, inviting visitors to linger amid stylish pedestrians. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 12, "location": "seaside road in Cape Town", "formality": 2, "description": "Step into a seaside road in Cape Town, where the hum of scooters meets sunlight filtering through awnings. This location blends modern energy with a local charm, inviting visitors to linger amid street performers nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 13, "location": "food market in Bangkok", "formality": 2, "description": "Step into a food market in Bangkok, where distant horns meets coffee steam rising from cups. This location blends modern energy with a local charm, inviting visitors to linger amid pop-up shops and stalls. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 14, "location": "harbor walk in Sydney", "formality": 2, "description": "Step into a harbor walk in Sydney, where laughter from nearby diners meets kids playing soccer. This location blends modern energy with a local charm, inviting visitors to linger amid lingering tourists. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 15, "location": "city square in Buenos Aires", "formality": 2, "description": "Step into a city square in Buenos Aires, where chirping birds in trees meets workers chatting at food stalls. This location blends modern energy with a local charm, inviting visitors to linger amid roaming photographers. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 16, "location": "plaza in Mexico City", "formality": 3, "description": "Step into a plaza in Mexico City, where footsteps echoing off buildings meets street art decorating the walls. This location blends modern energy with a local charm, inviting visitors to linger amid skaters and dancers moving through. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 17, "location": "bookstore in Edinburgh", "formality": 3, "description": "Step into a bookstore in Edinburgh, where buskers playing violins meets waves crashing in the distance. This location blends modern energy with a local charm, inviting visitors to linger amid artsy passersby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 18, "location": "arcade in Seoul", "formality": 3, "description": "Step into a arcade in Seoul, where rustling palm fronds meets commuters rushing past. This location blends modern energy with a local charm, inviting visitors to linger amid relaxed locals enjoying the scene. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 19, "location": "cobblestone street in Prague", "formality": 3, "description": "Step into a cobblestone street in Prague, where nearby skateboarders meets backpacks slung over shoulders. This location blends modern energy with a local charm, inviting visitors to linger amid visitors taking selfies. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 20, "location": "cultural hub in Nairobi", "formality": 3, "description": "Step into a cultural hub in Nairobi, where street musicians meets umbrellas lining the walkway. This location blends modern energy with a local charm, inviting visitors to linger amid content creators filming nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 21, "location": "open-air café in Montreal", "formality": 2, "description": "Step into a open-air café in Montreal, where faint music from a speaker meets local vendors shouting deals. This location blends modern energy with a local charm, inviting visitors to linger amid stylish pedestrians. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 22, "location": "pedestrian zone in Copenhagen", "formality": 2, "description": "Step into a pedestrian zone in Copenhagen, where the hum of scooters meets sunlight filtering through awnings. This location blends modern energy with a local charm, inviting visitors to linger amid street performers nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 23, "location": "train crossing in Munich", "formality": 2, "description": "Step into a train crossing in Munich, where distant horns meets coffee steam rising from cups. This location blends modern energy with a local charm, inviting visitors to linger amid pop-up shops and stalls. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 24, "location": "park bench in San Francisco", "formality": 2, "description": "Step into a park bench in San Francisco, where laughter from nearby diners meets kids playing soccer. This location blends modern energy with a local charm, inviting visitors to linger amid lingering tourists. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 25, "location": "rooftop bar in London", "formality": 2, "description": "Step into a rooftop bar in London, where chirping birds in trees meets workers chatting at food stalls. This location blends modern energy with a local charm, inviting visitors to linger amid roaming photographers. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 26, "location": "boutique row in Los Angeles", "formality": 3, "description": "Step into a boutique row in Los Angeles, where footsteps echoing off buildings meets street art decorating the walls. This location blends modern energy with a local charm, inviting visitors to linger amid skaters and dancers moving through. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 27, "location": "night street in Shanghai", "formality": 3, "description": "Step into a night street in Shanghai, where buskers playing violins meets waves crashing in the distance. This location blends modern energy with a local charm, inviting visitors to linger amid artsy passersby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 28, "location": "tram stop in Helsinki", "formality": 2, "description": "Step into a tram stop in Helsinki, where rustling palm fronds meets commuters rushing past. This location blends modern energy with a local charm, inviting visitors to linger amid relaxed locals enjoying the scene. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 29, "location": "covered bazaar in Istanbul", "formality": 2, "description": "Step into a covered bazaar in Istanbul, where nearby skateboarders meets backpacks slung over shoulders. This location blends modern energy with a local charm, inviting visitors to linger amid visitors taking selfies. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 30, "location": "riverbank trail in Portland", "formality": 2, "description": "Step into a riverbank trail in Portland, where street musicians meets umbrellas lining the walkway. This location blends modern energy with a local charm, inviting visitors to linger amid content creators filming nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 31, "location": "university campus in Boston", "formality": 2, "description": "Step into a university campus in Boston, where faint music from a speaker meets local vendors shouting deals. This location blends modern energy with a local charm, inviting visitors to linger amid stylish pedestrians. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 32, "location": "historic gate in Kyoto", "formality": 2, "description": "Step into a historic gate in Kyoto, where the hum of scooters meets sunlight filtering through awnings. This location blends modern energy with a local charm, inviting visitors to linger amid street performers nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 33, "location": "local eatery in Hanoi", "formality": 2, "description": "Step into a local eatery in Hanoi, where distant horns meets coffee steam rising from cups. This location blends modern energy with a local charm, inviting visitors to linger amid pop-up shops and stalls. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 34, "location": "waterfront in Auckland", "formality": 2, "description": "Step into a waterfront in Auckland, where laughter from nearby diners meets kids playing soccer. This location blends modern energy with a local charm, inviting visitors to linger amid lingering tourists. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 35, "location": "mall courtyard in Dubai", "formality": 2, "description": "Step into a mall courtyard in Dubai, where chirping birds in trees meets workers chatting at food stalls. This location blends modern energy with a local charm, inviting visitors to linger amid roaming photographers. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 36, "location": "hilltop park in Rio de Janeiro", "formality": 3, "description": "Step into a hilltop park in Rio de Janeiro, where footsteps echoing off buildings meets street art decorating the walls. This location blends modern energy with a local charm, inviting visitors to linger amid skaters and dancers moving through. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 37, "location": "city corner in Madrid", "formality": 3, "description": "Step into a city corner in Madrid, where buskers playing violins meets waves crashing in the distance. This location blends modern energy with a local charm, inviting visitors to linger amid artsy passersby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 38, "location": "midtown crosswalk in Manhattan", "formality": 2, "description": "Step into a midtown crosswalk in Manhattan, where rustling palm fronds meets commuters rushing past. This location blends modern energy with a local charm, inviting visitors to linger amid relaxed locals enjoying the scene. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 39, "location": "train bridge in Zurich", "formality": 2, "description": "Step into a train bridge in Zurich, where nearby skateboarders meets backpacks slung over shoulders. This location blends modern energy with a local charm, inviting visitors to linger amid visitors taking selfies. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 40, "location": "harbor overlook in Dubrovnik", "formality": 2, "description": "Step into a harbor overlook in Dubrovnik, where street musicians meets umbrellas lining the walkway. This location blends modern energy with a local charm, inviting visitors to linger amid content creators filming nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 41, "location": "downtown loop in Chicago", "formality": 2, "description": "Step into a downtown loop in Chicago, where faint music from a speaker meets local vendors shouting deals. This location blends modern energy with a local charm, inviting visitors to linger amid stylish pedestrians. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 42, "location": "skywalk in Kuala Lumpur", "formality": 2, "description": "Step into a skywalk in Kuala Lumpur, where the hum of scooters meets sunlight filtering through awnings. This location blends modern energy with a local charm, inviting visitors to linger amid street performers nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 43, "location": "city steps in Athens", "formality": 2, "description": "Step into a city steps in Athens, where distant horns meets coffee steam rising from cups. This location blends modern energy with a local charm, inviting visitors to linger amid pop-up shops and stalls. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 44, "location": "garden path in Singapore", "formality": 2, "description": "Step into a garden path in Singapore, where laughter from nearby diners meets kids playing soccer. This location blends modern energy with a local charm, inviting visitors to linger amid lingering tourists. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 45, "location": "pier café in Seattle", "formality": 2, "description": "Step into a pier café in Seattle, where chirping birds in trees meets workers chatting at food stalls. This location blends modern energy with a local charm, inviting visitors to linger amid roaming photographers. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 46, "location": "old cinema in Buenos Aires", "formality": 3, "description": "Step into a old cinema in Buenos Aires, where footsteps echoing off buildings meets street art decorating the walls. This location blends modern energy with a local charm, inviting visitors to linger amid skaters and dancers moving through. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 47, "location": "market square in Warsaw", "formality": 3, "description": "Step into a market square in Warsaw, where buskers playing violins meets waves crashing in the distance. This location blends modern energy with a local charm, inviting visitors to linger amid artsy passersby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 48, "location": "fountain plaza in Rome", "formality": 3, "description": "Step into a fountain plaza in Rome, where rustling palm fronds meets commuters rushing past. This location blends modern energy with a local charm, inviting visitors to linger amid relaxed locals enjoying the scene. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 49, "location": "clock tower district in Prague", "formality": 3, "description": "Step into a clock tower district in Prague, where nearby skateboarders meets backpacks slung over shoulders. This location blends modern energy with a local charm, inviting visitors to linger amid visitors taking selfies. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 50, "location": "arts quarter in Cape Town", "formality": 3, "description": "Step into a arts quarter in Cape Town, where street musicians meets umbrellas lining the walkway. This location blends modern energy with a local charm, inviting visitors to linger amid content creators filming nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 51, "location": "narrow shopping lane in Kyoto", "formality": 2, "description": "Step into a narrow shopping lane in Kyoto, where faint music from a speaker meets local vendors shouting deals. This location blends modern energy with a local charm, inviting visitors to linger amid stylish pedestrians. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 52, "location": "ferry ride in Vancouver", "formality": 2, "description": "Step into a ferry ride in Vancouver, where the hum of scooters meets sunlight filtering through awnings. This location blends modern energy with a local charm, inviting visitors to linger amid street performers nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 53, "location": "sunset pier in Santa Monica", "formality": 2, "description": "Step into a sunset pier in Santa Monica, where distant horns meets coffee steam rising from cups. This location blends modern energy with a local charm, inviting visitors to linger amid pop-up shops and stalls. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 54, "location": "suburban street in Melbourne", "formality": 2, "description": "Step into a suburban street in Melbourne, where laughter from nearby diners meets kids playing soccer. This location blends modern energy with a local charm, inviting visitors to linger amid lingering tourists. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 55, "location": "café terrace in Amsterdam", "formality": 2, "description": "Step into a café terrace in Amsterdam, where chirping birds in trees meets workers chatting at food stalls. This location blends modern energy with a local charm, inviting visitors to linger amid roaming photographers. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 56, "location": "train platform in Tokyo", "formality": 2, "description": "Step into a train platform in Tokyo, where footsteps echoing off buildings meets street art decorating the walls. This location blends modern energy with a local charm, inviting visitors to linger amid skaters and dancers moving through. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 57, "location": "historic alley in Lisbon", "formality": 3, "description": "Step into a historic alley in Lisbon, where buskers playing violins meets waves crashing in the distance. This location blends modern energy with a local charm, inviting visitors to linger amid artsy passersby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 58, "location": "boardwalk in Atlantic City", "formality": 3, "description": "Step into a boardwalk in Atlantic City, where rustling palm fronds meets commuters rushing past. This location blends modern energy with a local charm, inviting visitors to linger amid relaxed locals enjoying the scene. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 59, "location": "art district in Berlin", "formality": 3, "description": "Step into a art district in Berlin, where nearby skateboarders meets backpacks slung over shoulders. This location blends modern energy with a local charm, inviting visitors to linger amid visitors taking selfies. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 60, "location": "canal-side path in Venice", "formality": 3, "description": "Step into a canal-side path in Venice, where street musicians meets umbrellas lining the walkway. This location blends modern energy with a local charm, inviting visitors to linger amid content creators filming nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 61, "location": "metro entrance in Paris", "formality": 3, "description": "Step into a metro entrance in Paris, where faint music from a speaker meets local vendors shouting deals. This location blends modern energy with a local charm, inviting visitors to linger amid stylish pedestrians. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 62, "location": "corner diner in Brooklyn", "formality": 2, "description": "Step into a corner diner in Brooklyn, where the hum of scooters meets sunlight filtering through awnings. This location blends modern energy with a local charm, inviting visitors to linger amid street performers nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 63, "location": "seaside road in Cape Town", "formality": 2, "description": "Step into a seaside road in Cape Town, where distant horns meets coffee steam rising from cups. This location blends modern energy with a local charm, inviting visitors to linger amid pop-up shops and stalls. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 64, "location": "food market in Bangkok", "formality": 2, "description": "Step into a food market in Bangkok, where laughter from nearby diners meets kids playing soccer. This location blends modern energy with a local charm, inviting visitors to linger amid lingering tourists. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 65, "location": "harbor walk in Sydney", "formality": 2, "description": "Step into a harbor walk in Sydney, where chirping birds in trees meets workers chatting at food stalls. This location blends modern energy with a local charm, inviting visitors to linger amid roaming photographers. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 66, "location": "city square in Buenos Aires", "formality": 2, "description": "Step into a city square in Buenos Aires, where footsteps echoing off buildings meets street art decorating the walls. This location blends modern energy with a local charm, inviting visitors to linger amid skaters and dancers moving through. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 67, "location": "plaza in Mexico City", "formality": 3, "description": "Step into a plaza in Mexico City, where buskers playing violins meets waves crashing in the distance. This location blends modern energy with a local charm, inviting visitors to linger amid artsy passersby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 68, "location": "bookstore in Edinburgh", "formality": 3, "description": "Step into a bookstore in Edinburgh, where rustling palm fronds meets commuters rushing past. This location blends modern energy with a local charm, inviting visitors to linger amid relaxed locals enjoying the scene. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 69, "location": "arcade in Seoul", "formality": 3, "description": "Step into a arcade in Seoul, where nearby skateboarders meets backpacks slung over shoulders. This location blends modern energy with a local charm, inviting visitors to linger amid visitors taking selfies. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 70, "location": "cobblestone street in Prague", "formality": 3, "description": "Step into a cobblestone street in Prague, where street musicians meets umbrellas lining the walkway. This location blends modern energy with a local charm, inviting visitors to linger amid content creators filming nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 71, "location": "cultural hub in Nairobi", "formality": 3, "description": "Step into a cultural hub in Nairobi, where faint music from a speaker meets local vendors shouting deals. This location blends modern energy with a local charm, inviting visitors to linger amid stylish pedestrians. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 72, "location": "open-air café in Montreal", "formality": 2, "description": "Step into a open-air café in Montreal, where the hum of scooters meets sunlight filtering through awnings. This location blends modern energy with a local charm, inviting visitors to linger amid street performers nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 73, "location": "pedestrian zone in Copenhagen", "formality": 2, "description": "Step into a pedestrian zone in Copenhagen, where distant horns meets coffee steam rising from cups. This location blends modern energy with a local charm, inviting visitors to linger amid pop-up shops and stalls. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 74, "location": "train crossing in Munich", "formality": 2, "description": "Step into a train crossing in Munich, where laughter from nearby diners meets kids playing soccer. This location blends modern energy with a local charm, inviting visitors to linger amid lingering tourists. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 75, "location": "park bench in San Francisco", "formality": 2, "description": "Step into a park bench in San Francisco, where chirping birds in trees meets workers chatting at food stalls. This location blends modern energy with a local charm, inviting visitors to linger amid roaming photographers. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 76, "location": "rooftop bar in London", "formality": 2, "description": "Step into a rooftop bar in London, where footsteps echoing off buildings meets street art decorating the walls. This location blends modern energy with a local charm, inviting visitors to linger amid skaters and dancers moving through. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 77, "location": "boutique row in Los Angeles", "formality": 3, "description": "Step into a boutique row in Los Angeles, where buskers playing violins meets waves crashing in the distance. This location blends modern energy with a local charm, inviting visitors to linger amid artsy passersby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 78, "location": "night street in Shanghai", "formality": 3, "description": "Step into a night street in Shanghai, where rustling palm fronds meets commuters rushing past. This location blends modern energy with a local charm, inviting visitors to linger amid relaxed locals enjoying the scene. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 79, "location": "tram stop in Helsinki", "formality": 2, "description": "Step into a tram stop in Helsinki, where nearby skateboarders meets backpacks slung over shoulders. This location blends modern energy with a local charm, inviting visitors to linger amid visitors taking selfies. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 80, "location": "covered bazaar in Istanbul", "formality": 2, "description": "Step into a covered bazaar in Istanbul, where street musicians meets umbrellas lining the walkway. This location blends modern energy with a local charm, inviting visitors to linger amid content creators filming nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 81, "location": "riverbank trail in Portland", "formality": 2, "description": "Step into a riverbank trail in Portland, where faint music from a speaker meets local vendors shouting deals. This location blends modern energy with a local charm, inviting visitors to linger amid stylish pedestrians. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 82, "location": "university campus in Boston", "formality": 2, "description": "Step into a university campus in Boston, where the hum of scooters meets sunlight filtering through awnings. This location blends modern energy with a local charm, inviting visitors to linger amid street performers nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 83, "location": "historic gate in Kyoto", "formality": 2, "description": "Step into a historic gate in Kyoto, where distant horns meets coffee steam rising from cups. This location blends modern energy with a local charm, inviting visitors to linger amid pop-up shops and stalls. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 84, "location": "local eatery in Hanoi", "formality": 2, "description": "Step into a local eatery in Hanoi, where laughter from nearby diners meets kids playing soccer. This location blends modern energy with a local charm, inviting visitors to linger amid lingering tourists. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 85, "location": "waterfront in Auckland", "formality": 2, "description": "Step into a waterfront in Auckland, where chirping birds in trees meets workers chatting at food stalls. This location blends modern energy with a local charm, inviting visitors to linger amid roaming photographers. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 86, "location": "mall courtyard in Dubai", "formality": 2, "description": "Step into a mall courtyard in Dubai, where footsteps echoing off buildings meets street art decorating the walls. This location blends modern energy with a local charm, inviting visitors to linger amid skaters and dancers moving through. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 87, "location": "hilltop park in Rio de Janeiro", "formality": 3, "description": "Step into a hilltop park in Rio de Janeiro, where buskers playing violins meets waves crashing in the distance. This location blends modern energy with a local charm, inviting visitors to linger amid artsy passersby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 88, "location": "city corner in Madrid", "formality": 3, "description": "Step into a city corner in Madrid, where rustling palm fronds meets commuters rushing past. This location blends modern energy with a local charm, inviting visitors to linger amid relaxed locals enjoying the scene. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 89, "location": "midtown crosswalk in Manhattan", "formality": 2, "description": "Step into a midtown crosswalk in Manhattan, where nearby skateboarders meets backpacks slung over shoulders. This location blends modern energy with a local charm, inviting visitors to linger amid visitors taking selfies. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 90, "location": "train bridge in Zurich", "formality": 2, "description": "Step into a train bridge in Zurich, where street musicians meets umbrellas lining the walkway. This location blends modern energy with a local charm, inviting visitors to linger amid content creators filming nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 91, "location": "harbor overlook in Dubrovnik", "formality": 2, "description": "Step into a harbor overlook in Dubrovnik, where faint music from a speaker meets local vendors shouting deals. This location blends modern energy with a local charm, inviting visitors to linger amid stylish pedestrians. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 92, "location": "downtown loop in Chicago", "formality": 2, "description": "Step into a downtown loop in Chicago, where the hum of scooters meets sunlight filtering through awnings. This location blends modern energy with a local charm, inviting visitors to linger amid street performers nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 93, "location": "skywalk in Kuala Lumpur", "formality": 2, "description": "Step into a skywalk in Kuala Lumpur, where distant horns meets coffee steam rising from cups. This location blends modern energy with a local charm, inviting visitors to linger amid pop-up shops and stalls. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 94, "location": "city steps in Athens", "formality": 2, "description": "Step into a city steps in Athens, where laughter from nearby diners meets kids playing soccer. This location blends modern energy with a local charm, inviting visitors to linger amid lingering tourists. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 95, "location": "garden path in Singapore", "formality": 2, "description": "Step into a garden path in Singapore, where chirping birds in trees meets workers chatting at food stalls. This location blends modern energy with a local charm, inviting visitors to linger amid roaming photographers. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 96, "location": "pier café in Seattle", "formality": 2, "description": "Step into a pier café in Seattle, where footsteps echoing off buildings meets street art decorating the walls. This location blends modern energy with a local charm, inviting visitors to linger amid skaters and dancers moving through. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 97, "location": "old cinema in Buenos Aires", "formality": 3, "description": "Step into a old cinema in Buenos Aires, where buskers playing violins meets waves crashing in the distance. This location blends modern energy with a local charm, inviting visitors to linger amid artsy passersby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 98, "location": "market square in Warsaw", "formality": 3, "description": "Step into a market square in Warsaw, where rustling palm fronds meets commuters rushing past. This location blends modern energy with a local charm, inviting visitors to linger amid relaxed locals enjoying the scene. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 99, "location": "fountain plaza in Rome", "formality": 3, "description": "Step into a fountain plaza in Rome, where nearby skateboarders meets backpacks slung over shoulders. This location blends modern energy with a local charm, inviting visitors to linger amid visitors taking selfies. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 100, "location": "clock tower district in Prague", "formality": 3, "description": "Step into a clock tower district in Prague, where street musicians meets umbrellas lining the walkway. This location blends modern energy with a local charm, inviting visitors to linger amid content creators filming nearby. It's a perfect backdrop for both candid moments and curated visuals, offering texture, depth, and realism."},
  {"id": 101, "location": "Public library steps", "formality": 4, "description": "Climb the wide granite steps of the city library—students, suits, and tourists pause beneath neoclassical columns, pages turning in the breeze."},
  {"id": 102, "location": "Skate park half-pipe", "formality": 1, "description": "Echoes of wheels on concrete, graffiti splashes, and a low sun casting long shadows over cheering skaters."},
  {"id": 103, "location": "Community-center gym", "formality": 2, "description": "Bright LED lights, echoing sneakers, and pick-up basketball games under glossy hardwood floors."},
  {"id": 104, "location": "Town-hall front lawn", "formality": 4, "description": "Neatly trimmed grass, flagpoles, and occasional wedding photographers framing the stately façade."},
  {"id": 105, "location": "Corner laundromat", "formality": 1, "description": "Spinning machines hum behind wide glass windows while neighbors chat over folding tables and neon signs flicker."},
  {"id": 106, "location": "Subway station mezzanine", "formality": 2, "description": "Rushing footsteps, ticket machines beeping, and commuters silhouetted against tiled walls."},
  {"id": 107, "location": "Riverside jogging path", "formality": 2, "description": "Early-morning mist, rhythmic footfalls on asphalt, and sunbeams glinting off slow-moving water."},
  {"id": 108, "location": "Botanical-garden greenhouse", "formality": 3, "description": "Humid air, glass panes dripping condensation, and winding paths through exotic foliage."},
  {"id": 109, "location": "Saturday farmers’ market", "formality": 2, "description": "Canopy tents, burlap sacks of produce, and live acoustic guitar drifting between stalls."},
  {"id": 110, "location": "Historic movie-theatre lobby", "formality": 3, "description": "Art-deco chandeliers, velvet ropes, and the soft glow of marquee bulbs reflecting on polished floors."},
  {"id": 111, "location": "Back-alley mural wall", "formality": 1, "description": "Colorful street art splashed across brick, skateboards rolling over cracked pavement, and city sirens in the distance."},
  {"id": 112, "location": "Rooftop community garden", "formality": 2, "description": "Raised beds of herbs, wind chimes, and a skyline panorama under sunset gold."},
  {"id": 113, "location": "Business-district food-truck line", "formality": 2, "description": "Steam from grills, office badges swinging, and a jazz trio busking on the corner."},
  {"id": 114, "location": "High-school football bleachers", "formality": 2, "description": "Friday night lights, marching-band echoes, and popcorn drifting over wooden benches."},
  {"id": 115, "location": "Local craft-brewery patio", "formality": 2, "description": "String lights, clinking glasses, and food-truck smoke drifting over picnic tables."},
  {"id": 116, "location": "City-center fountain square", "formality": 3, "description": "Geometric pavers, water jets choreographed to music, and tourists circling with cameras."},
  {"id": 117, "location": "Neighborhood bodega entrance", "formality": 1, "description": "Neon beer signs, morning coffee regulars, and a cat lounging on stacked crates."},
  {"id": 118, "location": "Cobblestone courtyard café", "formality": 3, "description": "Iron tables, espresso steam, and ivy climbing ancient brick walls."},
  {"id": 119, "location": "Boutique barbershop façade", "formality": 2, "description": "Vintage red-white-blue pole, mirrors reflecting passing traffic, and conversation drifting through open doors."},
  {"id": 120, "location": "Pedestrian bridge at sunset", "formality": 3, "description": "Golden light on steel railings, river reflections below, and silhouettes of cyclists gliding past."},
  {"id": 121, "location": "Indoor climbing-gym lobby", "formality": 2, "description": "Colorful holds, chalk dust in the air, and motivational music pulsing over rubber-matted floors."},
  {"id": 122, "location": "Public-pool snack bar", "formality": 1, "description": "Splashing sounds, sunscreen scent, and kids queuing for ice-cream under striped umbrellas."},
  {"id": 123, "location": "City-planning museum steps", "formality": 4, "description": "Sweeping concrete stairs, modern sculptures, and reflective glass walls framing downtown views."},
  {"id": 124, "location": "Historic church side-door", "formality": 4, "description": "Weathered stone archways, quiet footsteps on cobblestones, and soft organ music seeping outside."},
  {"id": 125, "location": "Underground music venue alley", "formality": 1, "description": "Flickering neon band posters, bass lines vibrating through brick, and small groups sharing cigarettes."},
  {"id": 126, "location": "Modern co-working space lobby", "formality": 4, "description": "Minimalist sofas, espresso machines humming, and laptops glowing under pendant lights."},
  {"id": 127, "location": "Corner taco stand with neon sign", "formality": 1, "description": "Sizzling griddles, lime wedges on the counter, and late-night chatter under buzzing fluorescent letters."},
  {"id": 128, "location": "Gentrified warehouse coffee roaster", "formality": 3, "description": "Exposed brick, steel beams, and the scent of freshly ground beans drifting over communal tables."},
  {"id": 129, "location": "Old train-station waiting room", "formality": 3, "description": "Vintage benches, arched windows, and the click of departure boards updating in sepia light."},
  {"id": 130, "location": "City beach volleyball court", "formality": 1, "description": "Sand between toes, net silhouettes against sunset, and rhythmic thuds of ball and palm slaps."},
  {"id": 131, "location": "Art-school courtyard sculpture garden", "formality": 3, "description": "Abstract metal forms, chalk-stained backpacks, and students sketching in dappled shade."},
  {"id": 132, "location": "Residential rooftop at golden hour", "formality": 2, "description": "Potted succulents, string lights flickering on, and distant city rooftops glowing amber."},
  {"id": 133, "location": "Town-square ice-rink in winter", "formality": 3, "description": "Crisp air, shimmering fairy lights, and skaters circling a central Christmas tree."},
  {"id": 134, "location": "University quad between classes", "formality": 2, "description": "Frisbees overhead, coffee cups clutched like lifelines, and professors weaving through bike racks."},
  {"id": 135, "location": "Local comic-book shop doorway", "formality": 1, "description": "Posters of capes and aliens, sidewalk bins of discounted graphic novels, and fans trading recommendations."},
  {"id": 136, "location": "Eco-friendly hostel balcony", "formality": 2, "description": "Vertical gardens, solar fairy lights, and backpackers sharing travel stories over reusable mugs."},
  {"id": 137, "location": "Pop-up thrift market parking lot", "formality": 1, "description": "Racks of vintage denim, cassette tapes in crates, and DJs spinning lo-fi beats between stalls."},
  {"id": 138, "location": "City-hall observation deck", "formality": 4, "description": "Panoramic skyline views, brass telescopes chained to railings, and civic pride in the breeze."},
  {"id": 139, "location": "Bike-repair shop sidewalk", "formality": 1, "description": "Tools spread on a folding table, bike bells chiming, and the scent of chain oil mixing with coffee."},
  {"id": 140, "location": "Modern art museum plaza", "formality": 4, "description": "Reflective pools, polished stone benches, and visitors posing beside bold outdoor installations."},
  {"id": 141, "location": "Neighborhood bakery patio", "formality": 2, "description": "Croissant flakes on wrought-iron tables, steam from cappuccinos, and morning gossip exchanged over crusty baguettes."},
  {"id": 142, "location": "Historic firehouse façade", "formality": 3, "description": "Red brick and brass poles, gleaming engines visible through open bay doors, and a Dalmatian lounging on the apron."},
  {"id": 143, "location": "River ferry dock at twilight", "formality": 2, "description": "Gentle waves slapping hulls, lanterns flickering on the pier, and commuters boarding with bikes in tow."},
  {"id": 144, "location": "City-sponsored open-air yoga lawn", "formality": 2, "description": "Colorful mats in rows, soft instructor voice over Bluetooth speakers, and skyscrapers mirrored in mirrored sunglasses."},
  {"id": 145, "location": "Old brick-warehouse event space", "formality": 3, "description": "Exposed beams, string lights zig-zagging overhead, and the low hum of a sound-check echoing off brick."},
  {"id": 146, "location": "Vintage record-store entrance", "formality": 2, "description": "Crate-diggers flipping sleeves, speakers leaking classic rock, and the scent of worn cardboard sleeves."},
  {"id": 147, "location": "Pedestrian underpass with murals", "formality": 1, "description": "Colorful graffiti arcs overhead, scattered skateboarders, and footsteps echoing over painted concrete."},
  {"id": 148, "location": "Central bus terminal plaza", "formality": 2, "description": "Clocktower chimes, rolling luggage, and a mosaic of travelers beneath glass canopies."},
  {"id": 149, "location": "Riverside amphitheater steps", "formality": 3, "description": "Stone tiers descending toward water, fairy-light curtains, and acoustic sets drifting into the night."},
  {"id": 150, "location": "Town clock-tower base at noon", "formality": 3, "description": "Bells striking twelve, pigeons scattering, and townsfolk pausing for photos beneath the ancient timepiece."}
]